num1 = 7  # num1 - это число
num2 = 10  # num2 - это число
num3 = num1 + num2  # num3 - это число
print(num3)

s = '1992'
year = int(s)  # Преобразование строки к целому числу

num = 17
s = str(17)  # Преобразование целого числа к строке

"""Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке.
 Первое число вводит пользователь, остальные числа вычисляются в программе."""

first_num = int(input())
print(first_num)
print(first_num + 1)
print(first_num + 2)
